#include <iostream>
#include <conio.h>
// #include "students.h"// подключаем свою библиотеку работы со связным списком
						// список должен хранить данные о вашей предметной области
						// и реализовывать функции, согласно вашему заданию
using namespace std;

// функция добавления данных
void AddData() // TODO: HistLL
{
	system("cls");
	cout << "Добавление данных о автомобиле:\n";
	// здесь реализуете свой алгоритм
	_getch();
}

// функция печати данных
void PrintData() // TODO: HistLL
{
	system("cls");
	cout << "Список автомобилей в продаже:\n";
	// здесь реализуете свой алгоритм
	_getch();
}

// функция удаления данных
void DeleteData()
{
	system("cls");
	cout << "Введите уникальный номер автомобиля для удаления:\n";
	// здесь реализуете свой алгоритм
	_getch();
}

// функция печати данных по критерию отбора
void PrintFilteredData()
{
	system("cls");
	cout << "Поиск автомобиля по фильтру:\n"; // например выводим только отличников
	// здесь реализуете свой алгоритм
	_getch();
}

// функция загрузки данных
bool LoadData()
{
	// реализуйте здесь алгоритм чтения базы данных из файла
	// возвращайте true, если чтение прошло успешно и false в противном случае
	return true;
}

// вывод в консоль меню программы
char MainMenu()
{
	while (true) // бесконечный цикл
	{
		system("cls"); // чистим экран
		cout << "БАЗА ДАННЫХ ПОДДЕРЖАНЫХ АВТОМОБИЛЕЙ АВТОСАЛОНА\n\n"; // выводим название программы, оно у каждого буде свое
		// выводим строки меню, цивра в скобках - клавиша, которую нужно нажать для выбора соответствующего действия
		cout << "[1] Добавить автомобиль" << endl;
		cout << "[2] Вывести список автомобилей" << endl;
		cout << "[3] Поиск по фильтрам" << endl;
		cout << "[4] Удалить данные об автомобиле" << endl;
		cout << "[5] Завершить работу" << endl;

		cout << "Ваш выбор > ";
		char choice = _getch(); // считываем нажатую пользователем клавишу
		if (choice < '1' || choice > '5') // проверяем, соответствует ли клавиша пунктам меню
		{	// если нет, то требуем повторить ввод
			cout << "Такого варианта не существует! Нажмите любую клавишу...";
			_getch();
		}
		else
		{	// если соответствует, то возвращаем в вызываемую программу символ
			// соответствующий нажатой клавише
			return choice;
		}
	}
}

// обработка действий пользователя
void HandleEvents()
{
	char choice = 0;
	while (choice != '5') // цикл пока пользователь не нажал ВЫХОД
	{
		choice = MainMenu(); // определяем, какой пункт меню выбрал пользователь
		// переменная choice будет хранить символ, соответствующий 
		// выбранному пункту меню
		switch (choice) // проверяем какую клавишу нажал пользователь
		{
		case '1': // если 1 то вызываем функцию добавления данных
			AddData();
			break;
		case '2': // если 2 то вызываем функцию вывода данных
			PrintData();
			break;
		case '3': // если 4 то вызываем функцию удаления данных
			DeleteData();
			break;
		case '4': // если 5 то вызываем функцию вывода данных по фильтру
			PrintFilteredData();
			break;
		case '5': // // если 1 то выходим
			return;
		}
	}
}

int main()
{
	setlocale(LC_ALL, "");
	if (!LoadData()) // если чтение базы данных неудачно, то продолжение выполнения программы невозможно
	{	// выводим сообщение об ошибке и выходим с кодом 1
		cout << "Ошибка чтения базы данных\n";
		return 1;
		// как вариант, если базу прочитать невозможно, вы можете создать новую базу данных и продолжить работу
		// с программой
	}
	HandleEvents(); // вызываем функцию обработки нажатий клавиш пользователем
}
